app/controllers/api/app_data_controller.rb

INSERT INTO "appdata" ("dataname", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataname", nil], ["data", "{}"], ["created_at", "2023-06-23 10:20:28.496582"], ["updated_at", "2023-06-23 10:20:28.496582"]]
---
    def create
      puts "=============================================="
      puts "app_data_params===========#{app_data_params}"
      puts "=============================================="
      app_data = Appdatum.new(app_data_params)

      if app_data.save