app/controllers/api/test_app_controller.rb

    def create
      puts "=============================================="
      puts "test_app_params===========#{test_app_params}"
      puts "=============================================="
      test_app = TestApp.new(test_app_params)

      if test_app.save
---
INSERT INTO "test_apps" ("resource", "config", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["resource", "template"], ["config", "{\"color\":\"red\",\"number\":\"100\"}"], ["created_at", "2023-06-23 05:21:50.907565"], ["updated_at", "2023-06-23 05:21:50.907565"]]

    def index
    test_app_data = TestApp.all
---
SELECT "test_apps".* FROM "test_apps"

    def remove
      test_app = TestApp.find(params[:id])
      if test_app.destroy
---
SELECT "test_apps".* FROM "test_apps" WHERE "test_apps"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "test_apps" WHERE "test_apps"."id" = $1  [["id", 7]]