app/channels/my_rails_channel.rb

INSERT INTO "test_apps" ("resource", "config", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["resource", "lenovo thinkbook"], ["config", "{\"color\":\"white\",\"number\":\"1\"}"], ["created_at", "2023-06-30 04:39:59.350966"], ["updated_at", "2023-06-30 04:39:59.350966"]]
SELECT "test_apps".* FROM "test_apps"
---
  def add_template(template_data)
    template = TestApp.new(template_data)

    if template.save
      puts "Template added: #{template.inspect}"
      test_app_data = TestApp.all

SELECT "test_apps".* FROM "test_apps" WHERE "test_apps"."id" = $1 LIMIT $2  [["id", 85], ["LIMIT", 1]]
SELECT "test_apps".* FROM "test_apps"
---
  def delete_template(template_id)
    template = TestApp.find_by(id: template_id)

    if template&.destroy
      puts "Template deleted: #{template_id}"
      test_app_data = TestApp.all